package corp

/*
1. INC（Incorporated）
INC是最常见的美国公司后缀之一，它表示公司是一家股份有限公司。股份有限公司是一种由股东拥有股份并承担有限责任的公司形式。这意味着公司的债务和责任通常限于其资产，股东的个人财产不会受到影响。INC后缀通常用于大型公司和公共公司。

2. LLC（Limited Liability Company）
LLC是另一种常见的美国公司后缀，它表示公司是一家有限责任公司。有限责任公司是一种混合型公司形式，结合了股份有限公司和合伙企业的特点。LLC的所有者被称为成员，他们享有有限责任，类似于股份有限公司的股东。LLC后缀通常用于小型企业和家族企业。

3. LTD（Limited）
LTD是英国和其他英联邦国家常见的公司后缀，但在美国也有一些公司使用。LTD表示公司是一家有限公司，类似于INC后缀。然而，与INC不同的是，LTD后缀通常用于非营利组织和一些特殊类型的公司。

4. CORP（Corporation）
CORP是公司的简称，表示公司是一家股份公司。与INC类似，CORP后缀也表示公司是一家股份有限公司。CORP后缀通常用于大型公司和公共公司。
*/
